{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26], "dtype": "int32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": false, "batch_input_shape": [null, 26], "dtype": "float32", "input_dim": 2316, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 26}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["lstm_3", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}